In [13]:
import pandas as pd
import numpy as np

In [14]:
# 1 Assign A New Column To A Pandas DataFrame

In [15]:
# Create empty dataframe
df = pd.DataFrame()

# Create a column
df['name'] = ['John', 'Steve', 'Sarah']

# View dataframe
df

    name
0   John
1  Steve
2  Sarah

In [16]:
# Assign a new column to df called 'age' with a list of ages

df.assign(age=[30,31,32])

    name  age
0   John   30
1  Steve   31
2  Sarah   32

In [17]:
#2  Create A Pipeline In Pandas

In [18]:
# Create empty dataframe
df = pd.DataFrame()

# Create a column
df['name'] = ['John', 'Steve', 'Sarah']
df['gender'] = ['Male', 'Male', 'Female']
df['age'] = [31, 32, 19]

# View dataframe
df

    name  gender  age
0   John    Male   31
1  Steve    Male   32
2  Sarah  Female   19

In [19]:
def mean_age_by_group(dataframe, col):
    return dataframe.groupby(col).mean()

In [20]:
def upper_case_names(dataframe):
    dataframe.columns=dataframe.columns.str.upper()
    return dataframe

In [21]:
# Create a pipeline that applies the mean_age_by_group function
(df.pipe(mean_age_by_group, col='gender')
   # then applies the uppercase column name function
   .pipe(upper_case_names)
)

         AGE
gender
Female  19.0
Male    31.5

In [51]:
# Create a time series of 2000 elements, one very five minutes starting on 1/1/2000
time = pd.date_range('1/1/2000', periods=100, freq='5min')

# Create a pandas series with a random values between 0 and 100, using 'time' as the index
series1 = pd.Series(np.random.randint(100, size=100), index=time)

In [52]:
series1.groupby(series1.index.hour).mean()

0    50.500000
1    53.000000
2    33.416667
3    50.833333
4    43.250000
5    52.416667
6    52.750000
7    50.500000
8    45.750000
dtype: float64

In [54]:
series1.shape

(100,)

In [55]:
#3 Sort A List Of Names By Last Name

In [56]:
commander_names = ["Alan Brooke", "George Marshall", "Frank Jack Fletcher", "Conrad Helfrich", "Albert Kesselring"]

In [62]:
# Sort a variable called 'commander_names' by the last elements of each name.
sorted(commander_names, key=lambda x: x.split(" ")[0])

['Alan Brooke',
 'Albert Kesselring',
 'Conrad Helfrich',
 'Frank Jack Fletcher',
 'George Marshall']

In [63]:
# sort by length

In [66]:
sorted(commander_names, key=lambda x: len(x))

['Alan Brooke',
 'George Marshall',
 'Conrad Helfrich',
 'Albert Kesselring',
 'Frank Jack Fletcher']

In [67]:
#4  Rename Column Headers In Pandas

In [75]:
# Create a values as dictionary of lists
raw_data = {'0': ['first_name', 'Molly', 'Tina', 'Jake', 'Amy'],
        '1': ['last_name', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        '2': ['age', 52, 36, 24, 73],
        '3': ['preTestScore', 24, 31, 2, 3]}

# Create a dataframe
df = pd.DataFrame(raw_data)

# View a dataframe
df

            0          1    2             3
0  first_name  last_name  age  preTestScore
1       Molly   Jacobson   52            24
2        Tina        Ali   36            31
3        Jake     Milner   24             2
4         Amy      Cooze   73             3

In [76]:
headers = df.iloc[0]

In [77]:
df=df[1:]
df

       0         1   2   3
1  Molly  Jacobson  52  24
2   Tina       Ali  36  31
3   Jake    Milner  24   2
4    Amy     Cooze  73   3

In [79]:
# Rename the dataframe's column values with the header variable
df.rename(columns = headers)

  first_name last_name age preTestScore
1      Molly  Jacobson  52           24
2       Tina       Ali  36           31
3       Jake    Milner  24            2
4        Amy     Cooze  73            3

In [92]:
#5  Convert A String Categorical Variable To A Numeric Variable

In [94]:
raw_data = {'patient': [1, 1, 1, 2, 2],
        'obs': [1, 2, 3, 1, 2],
        'treatment': [0, 1, 0, 1, 0],
        'score': ['strong', 'weak', 'normal', 'weak', 'strong']}
df = pd.DataFrame(raw_data, columns = ['patient', 'obs', 'treatment', 'score'])
df

   patient  obs  treatment   score
0        1    1          0  strong
1        1    2          1    weak
2        1    3          0  normal
3        2    1          1    weak
4        2    2          0  strong

In [97]:
def conv_str_to_num_score(col):
    if col=='strong':
        return 3
    if col=='weak':
        return 2
    if col=='normal':
        return 1

In [99]:
df['score_num'] = df['score'].apply(conv_str_to_num_score)
df

   patient  obs  treatment   score  score_num
0        1    1          0  strong          3
1        1    2          1    weak          2
2        1    3          0  normal          1
3        2    1          1    weak          2
4        2    2          0  strong          3

In [ ]:
#6  Selecting Items In A List With Filters

In [104]:
# Create an list of items denoting the number of soldiers in each regiment, view the list
regimentSize = (5345, 6436, 3453, 2352, 5212, 6232, 2124, 3425, 1200, 1000, 1211); regimentSize

(5345, 6436, 3453, 2352, 5212, 6232, 2124, 3425, 1200, 1000, 1211)

In [105]:
# Create a list called smallRegiments that filters regimentSize to
# find all items that fulfill the lambda function (which looks for all items under 2500).
smallRegiments = list(filter((lambda x: x < 2500), regimentSize)); smallRegiments

[2352, 2124, 1200, 1000, 1211]

In [106]:
# Create a lambda function that looks for things under 2500
lessThan2500Filter = lambda x: x < 2500
filteredRegiments = filter(lessThan2500Filter, regimentSize)

In [108]:
list(filteredRegiments)

[2352, 2124, 1200, 1000, 1211]

In [109]:
#7   Flatten Lists Of Lists

In [110]:
# Create a list containing three lists of names
list_of_lists = [['Amy','Betty','Cathryn','Dana'],
                 ['Elizabeth','Fay','Gora'],
                  ['Heidi','Jane','Kayley']]

In [111]:
# For each element in list_of_lists, take each element in the list
flattened_list = [i for row in list_of_lists for i in row]

In [112]:
flattened_list

['Amy',
 'Betty',
 'Cathryn',
 'Dana',
 'Elizabeth',
 'Fay',
 'Gora',
 'Heidi',
 'Jane',
 'Kayley']

In [113]:
#8    Apply Functions By Group In Pandas

In [114]:
# Create an example dataframe
data = {'Platoon': ['A','A','A','A','A','A','B','B','B','B','B','C','C','C','C','C'],
       'Casualties': [1,4,5,7,5,5,6,1,4,5,6,7,4,6,4,6]}
df = pd.DataFrame(data)
df

    Casualties Platoon
0            1       A
1            4       A
2            5       A
3            7       A
4            5       A
5            5       A
6            6       B
7            1       B
8            4       B
9            5       B
10           6       B
11           7       C
12           4       C
13           6       C
14           4       C
15           6       C

In [117]:
df.groupby('Platoon')['Casualties'].apply(lambda x:x.rolling(center=False,window=2).mean())

0     NaN
1     2.5
2     4.5
3     6.0
4     6.0
5     5.0
6     NaN
7     3.5
8     2.5
9     4.5
10    5.5
11    NaN
12    5.5
13    5.0
14    5.0
15    5.0
Name: Casualties, dtype: float64

In [118]:
#9   Applying Operations Over pandas Dataframes

In [119]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

            coverage   name  reports  year
Cochice           25  Jason        4  2012
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014

In [138]:
df.columns=df.columns.str.lower(); headers

Index([u'COVERAGE', u'NAME', u'REPORTS', u'YEAR'], dtype='object')

In [141]:
#Apply the capitalizer function over the column 'name'

#apply() can apply a function along any axis of the dataframe

capitalizer = lambda x: x.upper()
df['name'].apply(capitalizer)

COCHICE       JASON
PIMA          MOLLY
SANTA CRUZ     TINA
MARICOPA       JAKE
YUMA            AMY
Name: name, dtype: object

In [143]:
#Map the capitalizer lambda function over each element in the series 'name'

#map() applies an operation over each element of a series

df['name'].map(capitalizer)

COCHICE       JASON
PIMA          MOLLY
SANTA CRUZ     TINA
MARICOPA       JAKE
YUMA            AMY
Name: name, dtype: object

In [144]:
# Drop the string variable so that applymap() can run
df = df.drop('name', axis=1)

# Return the square root of every cell in the dataframe
df.applymap(np.sqrt)

            coverage   reports       year
COCHICE     5.000000  2.000000  44.855323
PIMA        9.695360  4.898979  44.855323
SANTA CRUZ  7.549834  5.567764  44.866469
MARICOPA    7.874008  1.414214  44.877611
YUMA        8.366600  1.732051  44.877611

In [145]:
# create a function called times100
def times100(x):
    # that, if x is a string,
    if type(x) is str:
        # just returns it untouched
        return x
    # but, if not, return it multiplied by 100
    elif x:
        return 100 * x
    # and leave everything else
    else:
        return

In [146]:
df.applymap(times100)

            coverage  reports    year
COCHICE         2500      400  201200
PIMA            9400     2400  201200
SANTA CRUZ      5700     3100  201300
MARICOPA        6200      200  201400
YUMA            7000      300  201400

In [151]:
df[1:][2:].applymap(times100)

          coverage  reports    year
MARICOPA      6200      200  201400
YUMA          7000      300  201400

In [152]:
df

            coverage  reports  year
COCHICE           25        4  2012
PIMA              94       24  2012
SANTA CRUZ        57       31  2013
MARICOPA          62        2  2014
YUMA              70        3  2014

In [154]:
#10    Apply Operations To Groups In Pandas

In [265]:
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'],
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [266]:
regimentgroupby= df['preTestScore'].groupby(df['company'])
regimentgroupby

In [267]:
df1=pd.DataFrame(regimentgroupby.sum())
df1

         preTestScore
company
1st                40
2nd                93

In [268]:
#Descriptive statistics by group
df['preTestScore'].groupby(df['company']).describe()

company
1st      count     6.000000
         mean      6.666667
         std       8.524475
         min       2.000000
         25%       3.000000
         50%       3.500000
         75%       4.000000
         max      24.000000
2nd      count     6.000000
         mean     15.500000
         std      14.652645
         min       2.000000
         25%       2.250000
         50%      13.500000
         75%      29.250000
         max      31.000000
Name: preTestScore, dtype: float64

In [269]:
#Mean of each regiment's preTestScore
regimentgroupby.mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

In [270]:
#Mean preTestScores grouped by regiment and company
df['preTestScore'].groupby([df['regiment'], df['company']]).mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [271]:
#Mean preTestScores grouped by regiment and company without heirarchical indexing
df['preTestScore'].groupby([df['regiment'], df['company']]).mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [272]:
#Group the entire dataframe by regiment and company

In [275]:
df.groupby(['regiment', 'company'])['preTestScore'].mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [189]:
list(df.groupby(df.dtypes, axis=1))

[(dtype('int64'),     preTestScore  postTestScore
  0              4             25
  1             24             94
  2             31             57
  3              2             62
  4              3             70
  5              4             25
  6             24             94
  7             31             57
  8              2             62
  9              3             70
  10             2             62
  11             3             70),
 (dtype('O'),       regiment company      name
  0   Nighthawks     1st    Miller
  1   Nighthawks     1st  Jacobson
  2   Nighthawks     2nd       Ali
  3   Nighthawks     2nd    Milner
  4     Dragoons     1st     Cooze
  5     Dragoons     1st     Jacon
  6     Dragoons     2nd    Ryaner
  7     Dragoons     2nd      Sone
  8       Scouts     1st     Sloan
  9       Scouts     1st     Piger
  10      Scouts     2nd     Riani
  11      Scouts     2nd       Ali)]

In [190]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(), 'count': group.count(), 'mean': group.mean()}

In [192]:
#binning
bins=[0,25,50,75,100]

In [193]:
group_names = ['Low', 'Okay', 'Good', 'Great']

In [194]:
df['categories']=pd.cut(df['postTestScore'],bins,labels=group_names)

In [195]:
df

      regiment company      name  preTestScore  postTestScore categories
0   Nighthawks     1st    Miller             4             25        Low
1   Nighthawks     1st  Jacobson            24             94      Great
2   Nighthawks     2nd       Ali            31             57       Good
3   Nighthawks     2nd    Milner             2             62       Good
4     Dragoons     1st     Cooze             3             70       Good
5     Dragoons     1st     Jacon             4             25        Low
6     Dragoons     2nd    Ryaner            24             94      Great
7     Dragoons     2nd      Sone            31             57       Good
8       Scouts     1st     Sloan             2             62       Good
9       Scouts     1st     Piger             3             70       Good
10      Scouts     2nd     Riani             2             62       Good
11      Scouts     2nd       Ali             3             70       Good

In [200]:
df['postTestScore'].groupby(df['categories']).apply(get_stats).unstack().fillna('0')

            count max   mean min
categories
Low           2.0  25     25  25
Okay          0.0   0      0   0
Good          8.0  70  63.75  57
Great         2.0  94     94  94

In [201]:
pd.value_counts(df['categories'])

Good     8
Great    2
Low      2
Okay     0
Name: categories, dtype: int64

In [202]:
# Dummy Variables

In [203]:
# Create a dataframe
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'sex': ['male', 'female', 'male', 'female', 'female']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'sex'])
df

  first_name last_name     sex
0      Jason    Miller    male
1      Molly  Jacobson  female
2       Tina       Ali    male
3       Jake    Milner  female
4        Amy     Cooze  female

In [205]:
# Convert A Variable To A Time Variable In Pandas

In [206]:
# Create a dataset with the index being a set of names
raw_data = {'date': ['2014-06-01T01:21:38.004053', '2014-06-02T01:21:38.004053', '2014-06-03T01:21:38.004053'],
        'score': [25, 94, 57]}
df = pd.DataFrame(raw_data, columns = ['date', 'score'])
df

                         date  score
0  2014-06-01T01:21:38.004053     25
1  2014-06-02T01:21:38.004053     94
2  2014-06-03T01:21:38.004053     57

In [228]:
df['date_time']=pd.to_datetime(df["date"])
df

                         date  score                  date_time
0  2014-06-01T01:21:38.004053     25 2014-06-01 01:21:38.004053
1  2014-06-02T01:21:38.004053     94 2014-06-02 01:21:38.004053
2  2014-06-03T01:21:38.004053     57 2014-06-03 01:21:38.004053

In [230]:
df

                         date  score                  date_time
0  2014-06-01T01:21:38.004053     25 2014-06-01 01:21:38.004053
1  2014-06-02T01:21:38.004053     94 2014-06-02 01:21:38.004053
2  2014-06-03T01:21:38.004053     57 2014-06-03 01:21:38.004053

In [231]:
#Crosstabs In Pandas

In [232]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
        'company': ['infantry', 'infantry', 'cavalry', 'cavalry', 'infantry', 'infantry', 'cavalry', 'cavalry','infantry', 'infantry', 'cavalry', 'cavalry'],
        'experience': ['veteran', 'rookie', 'veteran', 'rookie', 'veteran', 'rookie', 'veteran', 'rookie','veteran', 'rookie', 'veteran', 'rookie'],
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'],
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'experience', 'name', 'preTestScore', 'postTestScore'])
df

      regiment   company experience      name  preTestScore  postTestScore
0   Nighthawks  infantry    veteran    Miller             4             25
1   Nighthawks  infantry     rookie  Jacobson            24             94
2   Nighthawks   cavalry    veteran       Ali            31             57
3   Nighthawks   cavalry     rookie    Milner             2             62
4     Dragoons  infantry    veteran     Cooze             3             70
5     Dragoons  infantry     rookie     Jacon             4             25
6     Dragoons   cavalry    veteran    Ryaner            24             94
7     Dragoons   cavalry     rookie      Sone            31             57
8       Scouts  infantry    veteran     Sloan             2             62
9       Scouts  infantry     rookie     Piger             3             70
10      Scouts   cavalry    veteran     Riani             2             62
11      Scouts   cavalry     rookie       Ali             3             70

In [237]:
pd.crosstab(df['regiment'], df['company'])

company     cavalry  infantry
regiment
Dragoons          2         2
Nighthawks        2         2
Scouts            2         2

In [242]:
pd.crosstab([df.company, df.experience], df.regiment,  margins=True)

regiment             Dragoons  Nighthawks  Scouts  All
company  experience
cavalry  rookie             1           1       1    3
         veteran            1           1       1    3
infantry rookie             1           1       1    3
         veteran            1           1       1    3
All                         4           4       4   12

In [249]:
del df['postTestScore']

In [250]:
df

      regiment   company experience      name  preTestScore
0   Nighthawks  infantry    veteran    Miller             4
1   Nighthawks  infantry     rookie  Jacobson            24
2   Nighthawks   cavalry    veteran       Ali            31
3   Nighthawks   cavalry     rookie    Milner             2
4     Dragoons  infantry    veteran     Cooze             3
5     Dragoons  infantry     rookie     Jacon             4
6     Dragoons   cavalry    veteran    Ryaner            24
7     Dragoons   cavalry     rookie      Sone            31
8       Scouts  infantry    veteran     Sloan             2
9       Scouts  infantry     rookie     Piger             3
10      Scouts   cavalry    veteran     Riani             2
11      Scouts   cavalry     rookie       Ali             3

In [251]:
df.T

,0,1,2,3,4,5,6,7,8,9,10,11
regiment,Nighthawks,Nighthawks,Nighthawks,Nighthawks,Dragoons,Dragoons,Dragoons,Dragoons,Scouts,Scouts,Scouts,Scouts
company,infantry,infantry,cavalry,cavalry,infantry,infantry,cavalry,cavalry,infantry,infantry,cavalry,cavalry
experience,veteran,rookie,veteran,rookie,veteran,rookie,veteran,rookie,veteran,rookie,veteran,rookie
name,Miller,Jacobson,Ali,Milner,Cooze,Jacon,Ryaner,Sone,Sloan,Piger,Riani,Ali
preTestScore,4,24,31,2,3,4,24,31,2,3,2,3

In [252]:
# Pivot tables

In [253]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
        'TestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'TestScore'])
df

      regiment company  TestScore
0   Nighthawks     1st          4
1   Nighthawks     1st         24
2   Nighthawks     2nd         31
3   Nighthawks     2nd          2
4     Dragoons     1st          3
5     Dragoons     1st          4
6     Dragoons     2nd         24
7     Dragoons     2nd         31
8       Scouts     1st          2
9       Scouts     1st          3
10      Scouts     2nd          2
11      Scouts     2nd          3

In [254]:
pd.pivot_table(df, index=['regiment','company'], aggfunc='mean')

                    TestScore
regiment   company
Dragoons   1st            3.5
           2nd           27.5
Nighthawks 1st           14.0
           2nd           16.5
Scouts     1st            2.5
           2nd            2.5

In [255]:
pd.pivot_table(df, index=['regiment','company'], aggfunc='count')

                    TestScore
regiment   company
Dragoons   1st              2
           2nd              2
Nighthawks 1st              2
           2nd              2
Scouts     1st              2
           2nd              2

In [256]:
pd.pivot_table(df, index=['regiment','company'], aggfunc='sum')

                    TestScore
regiment   company
Dragoons   1st              7
           2nd             55
Nighthawks 1st             28
           2nd             33
Scouts     1st              5
           2nd              5